//=============================================================
// Triangle.h
// 三角形描画クラスの定義
//=============================================================
#pragma once

//=============================================================
// include
//=============================================================
#include "DrawObject.h"

#include <d3d9.h>
#include <d3dx9.h>

//=============================================================
// Triangle
// 三角形描画クラス
// 基底クラス
//		DrawObject	: 描画オブジェクトの基底クラス
//=============================================================
class Triangle :
	public DrawObject
{
public:
	//---------------------------------------------------------
	// コンストラクタ
	//---------------------------------------------------------
	Triangle();

	//---------------------------------------------------------
	// 仮想デストラクタ
	//---------------------------------------------------------
	virtual ~Triangle();

private:

	// マトリックス
	D3DXMATRIX m_proj;	// 射影行列
	D3DXMATRIX m_view;	// ビューイング行列
	D3DXMATRIX m_world;	// ワールド行列

	// 頂点バッファの構造体
	struct MY_VERTEX
	{
		D3DXVECTOR3	p;		// 位置
		DWORD		color;	// 色
	};

	// 頂点バッファのフォーマットの定義
	const DWORD MY_VERTEX_FVF;

	// 頂点バッファへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVB;

public:
	//---------------------------------------------------------
	// 三角形を生成
	// 引数
	//		pD3DDevice : IDirect3DDevice9 インターフェイスへのポインタ
	// 戻り値
	//		成功したらS_OK
	//---------------------------------------------------------
	HRESULT Create(LPDIRECT3DDEVICE9 pD3DDevice);

	//---------------------------------------------------------
	// 座標変換を行う
	// 引数
	//		pD3DDevice : IDirect3DDevice9 インターフェイスへのポインタ
	//---------------------------------------------------------
	//void Transform(LPDIRECT3DDEVICE9 pD3DDevice);

	//---------------------------------------------------------
	// 三角形を描画
	// 引数
	//		pD3DDevice : IDirect3DDevice9 インターフェイスへのポインタ
	//---------------------------------------------------------
	void Draw(LPDIRECT3DDEVICE9 pD3DDevice);
};
